app/controllers/trips_controller.rb

  def index
    trips = Trip.where(user_id: params[:user_id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = $1  [["user_id", 1]]

  def create
    user = User.find(params[:user_id])
    trip = Trip.new(trip_params)
    puts params.inspect
    puts trip_params.inspect
    if trip.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "trips" ("location", "start", "summary", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["location", "loc4"], ["start", 2015-01-01 00:00:00 UTC], ["summary", "best trip EVER!!!"], ["user_id", 1], ["created_at", 2016-11-04 21:37:50 UTC], ["updated_at", 2016-11-04 21:37:50 UTC]]

  def update
    trip = Trip.find(params[:id])
    trip.update(trip_params)
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "trips" SET "location" = $1, "num_of_fish" = $2, "updated_at" = $3 WHERE "trips"."id" = $4  [["location", "San Jose"], ["num_of_fish", 20], ["updated_at", 2016-11-05 15:16:26 UTC], ["id", 13]]

  def destroy
    trip = Trip.find(params[:id])
    trip.destroy
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 31]]