app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "bob"], ["created_at", 2016-11-03 17:13:43 UTC], ["updated_at", 2016-11-03 17:13:43 UTC], ["password_digest", "$2a$10$RHXyGjBc8W82XPR3Q9QzfecjtXfHzZsrfOSHya5npPxe6peF6mJz2"]]

  def login
    puts params.inspect
    user = User.find_by(username: params[:user][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "bob"], ["LIMIT", 1]]